exampleCases/3DCondensationPipe/system/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2;
 format ascii;
 class dictionary;
 object controlDict;
}

application rhoSimpleFoam;

startFrom latestTime;

startTime 0;

stopAt endTime;

endTime 10001;

deltaT 1;

writeControl adjustableRunTime;

writeInterval 200;

purgeWrite 0;

writeFormat ascii;

writePrecision 6;

writeCompression no;
timeFormat general;

timePrecision 6;

runTimeModifiable yes;
adjustTimeStep yes;
maxCo 0.4;

functions
{
  turbulenceFields1
  {
    type turbulenceFields;
    libs
      (
        fieldFunctionObjects
      ); 	// Mandatory entries (unmodifiable)// Mandatory entries (runtime modifiable)// Either field or fields entries
    fields
      (
        epsilon
        R
      ); 	// Optional (inherited) entries
    enabled yes;
    log yes;
    executeControl writeTime;
    executeInterval 1;
    writeControl writeTime;
    writeInterval 1;
  }
} 	// ************************************************************************* //

