exampleCases/3DCondensationPipe/constant/turbulenceProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2;
 format ascii;
 class dictionary;
 object momentumTransport;
}

simulationType RAS;

RAS
{
  RASModel kOmegaSST;
  turbulence yes;
  printCoeffs yes;
  kOmegaSSTCoeffs
  {
    Prt 0.7;
  }
  LRRCoeffs
  {
    Prt 0.7;
  }
  SSGCoeffs
  {
    Prt 0.7;
  }
}

LES
{
  LESModel kOmegaSSTDES;
  delta cubeRootVol;
  turbulence yes;
  printCoeffs yes;
} 	// ************************************************************************* //

