exampleCases/3DCondensationPipe/0.org/p
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format binary;
 arch "LSB;label=32;scalar=64";
 class volScalarField;
 location "0";
 object p;
}

dimensions [ 1 -1 -2 0 0 0 0 ];

internalField uniform 100000.000000;

boundaryField
{
  pipe
  {
    type zeroGradient;
  }
  inlet
  {
    type zeroGradient;
  }
  FarField
  {
    type outletInlet;
    value uniform 100000.000000;
    outletValue uniform 100000.000000;
  }
} 	// ************************************************************************* //

