exampleCases/3DCondensationPipe/0.org/R
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format binary;
 arch "LSB;label=32;scalar=64";
 class volSymmTensorField;
 location "0";
 object R;
}

dimensions [ 0 2 -2 0 0 0 0 ];

internalField uniform (0.093750 0 0 0.046875 0 0.046875 );

boundaryField
{
  pipe
  {
    type kqRWallFunction;
    value uniform (0 0 0 0 0 0);
  }
  inlet
  {
    type fixedValue;
    value uniform (0.375000 0 0 0.187500 0 0.187500 );
  }
  FarField
  {
    type inletOutlet;
    value uniform (0.093750 0 0 0.046875 0 0.046875 );
    inletValue uniform (0.093750 0 0 0.046875 0 0.046875 );
  }
} 	// ************************************************************************* //

