exampleCases/3DCondensationPipe/0.org/T
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format binary;
 arch "LSB;label=32;scalar=64";
 class volScalarField;
 location "0";
 object T;
}

dimensions [ 0 0 0 1 0 0 0 ];

internalField uniform 298.000000;

boundaryField
{
  pipe
  {
    type zeroGradient;
  }
  inlet
  {
    type fixedValue;
    value uniform 500.000000;
  }
  FarField
  {
    type inletOutlet;
    value uniform 298.000000;
    inletValue uniform 298.000000;
  }
} 	// ************************************************************************* //

