exampleCases/3DCondensationPipe/0.org/epsilon
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format binary;
 arch "LSB;label=32;scalar=64";
 class volScalarField;
 location "0";
 object epsilon;
}

dimensions [ 0 2 -3 0 0 0 0 ];

internalField uniform 0.016845;

boundaryField
{
  pipe
  {
    type epsilonWallFunction;
    value uniform 0.000000;
  }
  inlet
  {
    type fixedValue;
    value uniform 8.984202;
  }
  FarField
  {
    type inletOutlet;
    inletValue uniform 0.016845;
    value uniform 0.016845;
  }
} 	// ************************************************************************* //

