exampleCases/3DCondensationPipe/0.org/k
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format binary;
 arch "LSB;label=32;scalar=64";
 class volScalarField;
 location "0";
 object k;
}

dimensions [ 0 2 -2 0 0 0 0 ];

internalField uniform 0.093750;

boundaryField
{
  pipe
  {
    type kqRWallFunction;
    value uniform 0.000000;
  }
  FarField
  {
    type inletOutlet;
    inletValue uniform 0.093750;
    value uniform 0.093750;
  }
  inlet
  {
    type turbulentIntensityKineticEnergyInlet;
    intensity 0.050000;
    value uniform 0.375000;
  }
} 	// ************************************************************************* //

