exampleCases/3DCondensationPipe/0.org/nut
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format binary;
 arch "LSB;label=32;scalar=64";
 class volScalarField;
 location "0";
 object nut;
}

dimensions [ 0 2 -1 0 0 0 0 ];

internalField uniform 0;

boundaryField
{
  pipe
  {
    type nutkWallFunction;
    value uniform 0;
  }
  FarField
  {
    type calculated;
    value uniform 0;
  }
  inlet
  {
    type calculated;
    value uniform 0;
  }
} 	// ************************************************************************* //

