exampleCases/3DCondensationPipe/0.org/omega
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 object omega;
}

dimensions [ 0 0 -1 0 0 0 0 ];

internalField uniform 37.267800;

boundaryField
{
  pipe
  {
    type omegaWallFunction;
    value uniform 100;
  }
  inlet
  {
    type fixedValue;
    value uniform 37.267800;
  }
  FarField
  {
    type inletOutlet;
    inletValue uniform 37.267800;
    value uniform 37.267800;
  }
} 	// ************************************************************************* //

