exampleCases/3DCondensationPipe/system/fvSchemes
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object fvSchemes;
}

ddtSchemes
{
  default Euler;
}

gradSchemes
{
  grad(R.component(0)) cellLimited Gauss linear       1 ;
  grad(R.component(1)) cellLimited Gauss linear       1 ; 	//running all turbulent quantities with limiters
  grad(R.component(2)) cellLimited Gauss linear       1 ;
  grad(R.component(3)) cellLimited Gauss linear       1 ;
  grad(R.component(4)) cellLimited Gauss linear       1 ;
  grad(R.component(5)) cellLimited Gauss linear       1 ;
  grad(k) cellLimited Gauss linear       1 ;
  grad(omega) cellLimited Gauss linear       1 ;
  grad(epsilon) cellLimited Gauss linear       1 ; 	//just as test lets limit h as well
  grad(h) cellLimited Gauss linear       1 ; 	//Grad von U ist save das Problem
  default cellLimited Gauss linear       1 ; 	//default Gauss linear ;
}

divSchemes
{
  default none;
  energy Gauss linearUpwind default ;
  scalars Gauss linearUpwind default ; 	//linearUpwind default;
  turbulence Gauss linearUpwind default ;
  div(phi,U) Gauss linearUpwind grad(U) ; 	//div(phi,K) $scalars;
  div(phi,h) $energy;
  div(phi,e) $energy;
  div(phi,k) $scalars;
  div(phi,R) $turbulence; 	//could try upwind
  div(phi,Ekp) $scalars;
  div(phi,omega) $scalars;
  div(phi,epsilon) Gauss upwind ;
  div(phi,Yi_h) Gauss multivariateSelection {
        air limitedLinear01             1 ;
        h limitedLinear             1 ;
        liquidH2O limitedLinear01             1 ;
        vapourH2O limitedLinear01             1 ;
      } ;
  div(Ji,Ii_h) $scalars;
  div(phi,vapourH2O) $scalars;
  div(phi,K) $scalars;
  div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear ;
  div(((rho*(thermo:mu|rho))*dev2(T(grad(U))))) Gauss linear ;
  div((rho*R)) Gauss linear ;
}

laplacianSchemes
{
  default Gauss linear limited       1 ;
}

interpolationSchemes
{
  default linear;
}

snGradSchemes
{
  default limited       1.0 ;
}

wallDist
{
  method meshWave;
  nRequired yes;
} 	// ************************************************************************* //// ************************************************************************* //

