exampleCases/3DCondensationPipe/system/fvSolution
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object fvSolution;
}

solvers
{
  "(rho|rhoFinal)"
  {
    solver diagonal;
  }

  //p
  //{
  //  solver GAMG;
  //  tolerance 1e-06;
  //  relTol 0;
  //  smoother GaussSeidel;
  //  nPreSweeps  0;
  //  nPostSweeps 2;
  //  cacheAgglomeration on;
  //  agglomerator  faceAreaPair;
  //  nCellsInCoarsestLevel 100;
  //  mergeLevels 1;
  //  minIter   3;
  //}
  p { 
    solver PCG;
     preconditioner DIC;
      tolerance 1e-6;
       relTol 0.01;
    }
  pFinal
  {
    $p ;
    tolerance 1e-06;
    relTol 0;
    maxIter 1000;
  }
  "(U|Yi|k|h|epsilon|R|omega|e)"
  {
    solver PBiCGStab;
    preconditioner DILU;
    tolerance 1e-08;
    relTol 0.0;
  }
  "(U|Yi|k|h|epsilon|R|omega|e)Final"
  {
    $U ;
    tolerance 1e-08;
    relTol 0;
  }
}

PIMPLE
{
  momentumPredictor yes;

  nOuterCorrectors 2;

  nCorrectors 4;
  
  nNonOrthogonalCorrectors 1;

  turbOnFinalIterOnly yes;
}

//relaxationFactors
//{
//  fields
//  {
//    p 0.5;
//    rho 0.5;
//  }
//  equations
//  {
//    U 0.5;
//    "(k|epsilon|omega|R|chiVapour)" 0.5;
//    e 0.5;
//    h 0.5;
//    "(CH4|O2|H2O|CO2).*" 1;
//    "(k|epsilon|omega|R)" 0.3;
//    "(k|epsilon|omega|R)" 0.3;
//  }
//} 	/*
// ************************************************************************* //

